Revit 2026 API

# UIControlledApplicationCreateAddInCommandBinding Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AddInCommandBinding CreateAddInCommandBinding(
	RevitCommandId revitCommandId
)
```
```vb
Public Function CreateAddInCommandBinding (
	revitCommandId As RevitCommandId
) As AddInCommandBinding
```
```cpp
public:
AddInCommandBinding^ CreateAddInCommandBinding(
	RevitCommandId^ revitCommandId
)
```
```fsharp
member CreateAddInCommandBinding :
        revitCommandId : RevitCommandId -> AddInCommandBinding
```

#### Parameters

revitCommandId RevitCommandId

#### Return Value

AddInCommandBinding

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace